
//Атняшов В. А.: Добавить реквизит КонтактноеЛицо
Процедура ДополнитьФорму(Форма, ДобавитьВставить) Экспорт
	Элементы = Форма.Элементы;
	КонтактноеЛицо = "КонтактноеЛицо";
	ПолеФормы = Тип("ПолеФормы");
	Если ДобавитьВставить Тогда
		ПолеВвода = Элементы.Добавить(КонтактноеЛицо, ПолеФормы, Элементы.ГруппаШапкаПраво);
	Иначе
		ПолеВвода = Элементы.Вставить(КонтактноеЛицо, ПолеФормы, , Элементы.СуммаДокумента);
	КонецЕсли; 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Доработка_КонтактноеЛицо";
КонецПроцедуры
//
 