#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//Атняшов В. А.: Ответственный (заполнение документа)
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		// Заполнение шапки
		Запрос = Новый Запрос(
  		"ВЫБРАТЬ
  		| РеализацияТоваровУслуг.Договор,
  		| РеализацияТоваровУслуг.Комментарий,
  		| РеализацияТоваровУслуг.Организация,
  		| РеализацияТоваровУслуг.Ссылка
  		|ИЗ
  		| Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
  		|ГДЕ
  		| РеализацияТоваровУслуг.Ссылка = &Ссылка");
  		
 		Запрос.УстановитьПараметр("Ссылка", Ссылка);
 		Выборка = Запрос.Выполнить().Выбрать();
 		Выборка.Следующий();

        Договор = Выборка.Договор;
		Комментарий = Выборка.Комментарий;
		Контрагент = Выборка.Контрагент;
		Организация = Выборка.Организация;
		Основание = Ссылка;
		Ответственный = Пользователи.ТекущийПользователь();

		Запрос = Новый Запрос(
  		"ВЫБРАТЬ
  		|	РеализацияТоваровУслуг.Товары.(
  		|		Количество КАК Количество,
  		|		Номенклатура КАК Номенклатура
  		|	) КАК Товары
  		|ИЗ
  		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
  		|ГДЕ
  		|	РеализацияТоваровУслуг.Ссылка = &Ссылка");
  		
 		Запрос.УстановитьПараметр("Ссылка", Ссылка);
 		Выборка = Запрос.Выполнить().Выбрать();

 		Пока Выборка.Следующий() Цикл
		    НоваяСтрока = Товары.Добавить();
		    НоваяСтрока.Количество = Выборка.Количество;
		    НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		КонецЦикла;

	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
//

#КонецОбласти

#КонецЕсли
